In [29]:
# Add required imports for cleaning
import pandas as pd
import numpy as np

In [30]:
# This csv file is seperated by ; so we set sep = ';'
df = pd.read_csv('animal_data_dirty1.csv',sep=';')

In [31]:
df.shape

(1011, 11)

In [32]:
df # We can already look there are many errors in the dataset.

,Animal type,Country,Weight kg,Body Length cm,Gender,Animal code,Latitude,Longitude,Animal name,Observation date,Data compiled by
0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,03.01.2024,James Johnson
1,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,03.02.2024,James Johnson
2,European bison,Poland,930.000,335.0,male,NaN,52.828845,23.820144,Szefu,01.03.2024,Anne Anthony
3,European bison,Poland,909.000,311.0,not determined,NaN,52.830509,23.826849,NaN,01.03.2024,Anne Anthony
4,European bison™,Poland,581.000,277.0,female,NaN,52.834109,23.807093,NaN,01.03.2024,Anne Anthony
...,...,...,...,...,...,...,...,...,...,...,...
1006,red squirrel,Poland,0.346,20.0,female,NaN,52.212001,21.033187,Lola,7 May 2024,Anne Anthony
1007,hedgehog,Germany,1.000,23.0,female,NaN,49.561356,11.105334,NaN,7 May 2024,Bob Bobson
1008,hedgehog,Germany,0.500,17.0,female,NaN,49.561569,11.087046,NaN,7 May 2024,Bob Bobson
1009,red squirrel,Poland,0.346,20.0,female,NaN,52.212001,21.033187,Lola,7 May 2024,Anne Anthony
1010,hedgehog,Hungary,0.900,16.0,female,NaN,47.509860,18.939943,NaN,8 May 2024,Anne Anthony

In [33]:
df.info() # Analyzing the columns to look for the number of rows missing in each

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1011 entries, 0 to 1010
Data columns (total 11 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Animal type       991 non-null    object
 1   Country           999 non-null    object
 2   Weight kg         984 non-null    float64
 3   Body Length cm    984 non-null    float64
 4   Gender            992 non-null    object
 5   Animal code       0 non-null      float64
 6   Latitude          913 non-null    float64
 7   Longitude         913 non-null    float64
 8   Animal name       52 non-null     object
 9   Observation date  1011 non-null   object
 10  Data compiled by  1011 non-null   object
dtypes: float64(5), object(6)
memory usage: 87.0+ KB

In [34]:
df.isnull().sum()

Animal type           20
Country               12
Weight kg             27
Body Length cm        27
Gender                19
Animal code         1011
Latitude              98
Longitude             98
Animal name          959
Observation date       0
Data compiled by       0
dtype: int64

In [35]:
# As there are no values in Animal code we are gonna drop that column.
df = df.drop(columns=['Animal code'])

In [36]:
df

,Animal type,Country,Weight kg,Body Length cm,Gender,Latitude,Longitude,Animal name,Observation date,Data compiled by
0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,03.01.2024,James Johnson
1,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,03.02.2024,James Johnson
2,European bison,Poland,930.000,335.0,male,52.828845,23.820144,Szefu,01.03.2024,Anne Anthony
3,European bison,Poland,909.000,311.0,not determined,52.830509,23.826849,NaN,01.03.2024,Anne Anthony
4,European bison™,Poland,581.000,277.0,female,52.834109,23.807093,NaN,01.03.2024,Anne Anthony
...,...,...,...,...,...,...,...,...,...,...
1006,red squirrel,Poland,0.346,20.0,female,52.212001,21.033187,Lola,7 May 2024,Anne Anthony
1007,hedgehog,Germany,1.000,23.0,female,49.561356,11.105334,NaN,7 May 2024,Bob Bobson
1008,hedgehog,Germany,0.500,17.0,female,49.561569,11.087046,NaN,7 May 2024,Bob Bobson
1009,red squirrel,Poland,0.346,20.0,female,52.212001,21.033187,Lola,7 May 2024,Anne Anthony
1010,hedgehog,Hungary,0.900,16.0,female,47.509860,18.939943,NaN,8 May 2024,Anne Anthony

In [37]:
dropped_rows = df[df.notnull().sum(axis=1) < 8]

In [38]:
dropped_rows

,Animal type,Country,Weight kg,Body Length cm,Gender,Latitude,Longitude,Animal name,Observation date,Data compiled by
0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,03.01.2024,James Johnson
1,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,03.02.2024,James Johnson
13,red squirrel,Poland,0.333,21.0,male,NaN,NaN,NaN,01.03.2024,Anne Anthony
15,red squirrel,Poland,NaN,NaN,male,52.241177,21.052873,NaN,01.03.2024,Anne Anthony
21,red squirrel,Germany,0.294,19.0,male,NaN,NaN,NaN,01.03.2024,Bob Bobson
...,...,...,...,...,...,...,...,...,...,...
968,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,03.13.2024,James Johnson
969,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,03.14.2024,James Johnson
970,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,03.22.2024,James Johnson
971,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,03.22.2024,James Johnson
972,hedgehog,Hungary,NaN,NaN,male,47.509755,18.949465,NaN,1 May 2024,Anne Anthony

In [39]:
df.dropna(thresh=8,inplace=True)

In [40]:
df

,Animal type,Country,Weight kg,Body Length cm,Gender,Latitude,Longitude,Animal name,Observation date,Data compiled by
2,European bison,Poland,930.000,335.0,male,52.828845,23.820144,Szefu,01.03.2024,Anne Anthony
3,European bison,Poland,909.000,311.0,not determined,52.830509,23.826849,NaN,01.03.2024,Anne Anthony
4,European bison™,Poland,581.000,277.0,female,52.834109,23.807093,NaN,01.03.2024,Anne Anthony
5,European bisson,Poland,900.000,295.0,male,52.834759,23.817201,NaN,01.03.2024,Anne Anthony
6,European buster,Poland,620.000,250.0,female,52.834960,23.820750,NaN,01.03.2024,Anne Anthony
...,...,...,...,...,...,...,...,...,...,...
1006,red squirrel,Poland,0.346,20.0,female,52.212001,21.033187,Lola,7 May 2024,Anne Anthony
1007,hedgehog,Germany,1.000,23.0,female,49.561356,11.105334,NaN,7 May 2024,Bob Bobson
1008,hedgehog,Germany,0.500,17.0,female,49.561569,11.087046,NaN,7 May 2024,Bob Bobson
1009,red squirrel,Poland,0.346,20.0,female,52.212001,21.033187,Lola,7 May 2024,Anne Anthony
1010,hedgehog,Hungary,0.900,16.0,female,47.509860,18.939943,NaN,8 May 2024,Anne Anthony